require("../../config.js");
require("../../Core.js");
const {
  proto,
  generateWAMessageFromContent,
  prepareWAMessageMedia,
} = require("@adiwajshing/baileys");

module.exports = {
  name: "menu",
  alias: ["menu"],
  desc: "Sliding Marin-MD Help Menu",
  category: "Core",
  react: "✨",

  start: async (Miku, m, { prefix, pushName }) => {

    const welcomeText = `Swipe left/right to explore menu\n🎀Tap The Below Button To See Complete Command List.`;

    const sections = [
      {
        title: "*🎐 CORE COMMANDS*",
        desc: `
  𝑯𝑬𝑳𝑳𝑶
  𝑯𝑬𝑳𝑷
  𝑴𝑬𝑵𝑼
  𝑹𝑬𝑮𝑰𝑺𝑻𝑬𝑹
  𝑷𝑹𝑶𝑭𝑰𝑳𝑬
  𝑬𝑫𝑰𝑻𝑷𝑹𝑶𝑭𝑰𝑳𝑬
  𝐀𝐅𝐊
  𝑶𝑾𝑵𝑬𝑹
  𝑺𝑪𝑹𝐼𝑷𝑻
  𝑺𝑼𝑷𝑷𝑶𝑹𝑻

        `, cmd: `${prefix}coremenu`
      },
      {
        title: "*〽️GROUP COMMANDS*",
        desc: `
  𝑨𝑫𝑴𝑰𝑵𝑺
  𝑷𝑰𝑵𝑮
  𝑨𝑵𝑻𝑰𝑳𝑰𝑵𝑲𝑮𝑪
  𝑪𝑯𝑨𝑻𝑩𝑶𝑻𝑮𝑪
  𝑫𝑬𝑳𝑬𝑻𝑬
  𝑷𝑹𝑶𝑴𝑶𝑻𝑬
  𝑫𝑬𝑴𝑶𝑻𝑬
  𝑷𝑶𝑲𝑬𝑴𝑶𝑵
  𝑯𝑰𝑫𝑬𝑻𝑨𝑮
  𝑵𝑺𝑭𝑾
  𝑹𝑬𝑷𝑶𝑹𝑻
  𝑩𝑶𝑻𝑺𝑾𝑰𝑻𝑪𝑯
  𝑪𝑨𝑹𝑫𝑺𝑾𝑰𝑻𝑪𝑯

        
        `, cmd: `${prefix}groupmenu`
      },
      {
        title: "*🪼 MODS COMMANDS*",
        desc: `
  𝑨𝑫𝑫𝑴𝑶𝑫
  𝑫𝑬𝑳𝑬𝑻𝑬𝑴𝑶𝑫
  𝑩𝑨𝑵
  𝑼𝑵𝑩𝑨𝑵
  𝑩𝑨𝑵𝑮𝑪
  𝑼𝑵𝑩𝑨𝑵𝑮𝑪
  𝑩𝑳𝑶𝑪𝑲
  𝑼𝑵𝑩𝑳𝑶𝑪𝑲
  𝑩𝑹𝑶𝑨𝑫𝑪𝑨𝑺𝑻
  𝑴𝑶𝑫𝑬
  𝑩𝑨𝑵𝑳𝑰𝑺𝑻
  𝑷𝑴𝑪𝑯𝑨𝑻𝑩𝑶𝑻

         `, cmd: `${prefix}modsmenu`
      },
      {
        title: "*🎗️ MEDIA COMMANDS*",
        desc: `
  𝑰𝑮𝑫𝑳
  𝑺𝑷𝑶𝑻𝑰𝑭𝒀
  𝒀𝑻𝑴𝑰𝑿
  𝑷𝑳𝑨𝒀𝑳𝑰𝑺𝑻
  𝑷𝑳𝑨𝒀
  𝒀𝑻𝑨𝑼𝑫𝑰𝑶
  𝒀𝑻𝑽𝑰𝑫𝑬𝑶
  𝒀𝑻𝑺

         `, cmd: `${prefix}mediamenu`
      },
      {
        title: "*🔎 SEARCH COMMANDS*",
        desc: `
  𝑨𝑵𝑰𝑴𝑬
  𝑪𝑶𝑼𝑷𝑳𝑬𝑷𝑷
  𝑮𝑰𝑭𝑺𝑬𝑨𝑹𝑪𝑯
  𝑮𝑰𝑴𝑨𝑮𝑬
  𝑷𝑰𝑵𝑻𝑬𝑹𝑬𝑺𝑻
  𝑮𝑰𝑻𝑯𝑼𝑩
  𝑮𝑶𝑶𝑮𝑳𝑬
  𝑳𝒀𝑹𝑰𝑪𝑺
  𝑹𝑰𝑵𝑮𝑻𝑶𝑵𝑬
  𝑾𝑬𝑨𝑻𝑯𝑬𝑹
  𝑺𝑻𝑰𝑪𝑲𝑬𝑹𝑺𝑬𝑨𝑹𝑪𝑯
  𝒀𝑶𝑼𝑻𝑼𝑩𝑬𝑺𝑬𝑨𝑹𝑪𝑯

       `, cmd: `${prefix}searchmenu`
      },
      {
        title: "*🎡 RPG COMMANDS*",
        desc: `
  𝑨𝑽𝑰𝑨𝑻𝑶𝑹
  𝑩𝑼𝒀
  𝑪𝑹𝑨𝑭𝑻
  𝑪𝑹𝑨𝑺𝑯𝑻𝑶𝑾𝑬𝑹
  𝑰𝑵𝑽𝑬𝑵𝑻𝑶𝑹𝒀
  𝑴𝑰𝑵𝑬
  𝑴𝑰𝑵𝑬𝑪𝑹𝑨𝑭𝑻
  𝑹𝑬𝑫𝑩𝑳𝑨𝑪𝑲
  𝑺𝑯𝑨𝑹𝑲
  𝑺𝑯𝑶𝑷
  𝑺𝑳𝑶𝑻
  𝑻𝑰𝑴𝑬𝑩𝑶𝑴𝑩

        `, cmd: `${prefix}rpgmenu`
      },
      {
        title: "*🧧 ECONOMY COMMANDS*",
        desc: `
  𝑩𝑨𝑵𝑲
  𝑪𝑨𝑷𝑨𝑪𝑰𝑻𝒀
  𝑫𝑨𝑰𝑳𝒀
  𝑫𝑬𝑷𝑶𝑺𝑰𝑻
  𝑮𝑨𝑴𝑩𝑳𝑬
  𝑳𝑩
  𝑹𝑶𝑩
  𝑻𝑹𝑨𝑵𝑺𝑭𝑬𝑹
  𝑾𝑨𝑳𝑳𝑬𝑻
  𝑾𝑰𝑻𝑯𝑫𝑹𝑨𝑾

        `, cmd: `${prefix}economymenu`
      },
      {
        title: "*🎴 CARDS COMMANDS*",
        desc: `
  𝑫𝑬𝑪𝑲
  𝑨𝑫𝑫𝑳𝑰𝑺𝑻
  𝑫𝑬𝑳𝑳𝑰𝑺𝑻
  𝑴𝒀𝑺𝑻𝑨𝑻𝑺
  𝑩𝑼𝒀𝑪𝑨𝑹𝑫
  𝑪𝑨𝑹𝑫𝑩𝑨𝑻𝑻𝑳𝑬
  𝑪𝑨𝑹𝑫𝑰𝑵𝑭𝑶
  𝑪𝑨𝑹𝑫𝑴𝑨𝑹𝑲𝑬𝑻
  𝑪𝑨𝑹𝑫𝑻𝑹𝑨𝑫𝑬
  𝑪𝑳𝑨𝑰𝑴
  𝑮𝑰𝑽𝑬𝑪𝑨𝑹𝑫
  𝑳𝑩𝑪𝑨𝑹𝑫

        `, cmd: `${prefix}cardmenu`
      },
      {
        title: "*🦕 POKEMON COMMANDS*",
        desc: `
  𝑷𝑶𝑲𝑬𝑩𝑨𝑻𝑻𝑳𝑬
  𝑷𝑶𝑲𝑬𝑪𝑨𝑻𝑪𝑯
  𝑷𝑶𝑲𝑬𝑫𝑬𝑪𝑲
  𝑷𝑶𝑲𝑬𝑭𝑬𝑬𝑫
  𝑷𝑶𝑲𝑬𝑮𝑰𝑭𝑻
  𝑷𝑶𝑲𝑬𝑯𝑬𝑨𝑳
  𝑷𝑶𝑲𝑬𝑰𝑵𝑭𝑶
  𝑷𝑶𝑲𝑬𝑷𝑹𝑶𝑻𝑬𝑪𝑻
  𝑷𝑶𝑲𝑬𝑹𝑬𝑳𝑬𝑨𝑺𝑬
  𝑷𝑶𝑲𝑬𝑹𝑬𝑵𝑨𝑴𝑬
  𝑷𝑶𝑲𝑬𝑺𝑬𝑻
  𝑷𝑶𝑲𝑬𝑺𝑻𝑨𝑹𝑻
  𝑷𝑶𝑲𝑬𝑻𝑹𝑨𝑰𝑵

        `, cmd: `${prefix}pokemenu`
      },

      {
        title: "*🔮 UTILITIES COMMANDS*",
        desc: `
  𝑬𝑴𝑶𝑱𝑰𝑴𝑰Ϙ
  Ϙ𝑼𝑶𝑻𝑬
  𝑺𝑻𝑰𝑪𝑲𝑬𝑹
  𝑺𝑻𝑰𝑪𝑲𝑬𝑹𝑪𝑹𝑶𝑷
  𝑺𝑻𝑬𝑨𝑳
  𝑻𝑶𝑨𝑼𝑫𝑰𝑶
  𝑻𝑶𝑮𝑰Ϝ
  𝑻𝑶𝑰𝑴𝑮
  𝑻𝑶𝑴𝑷3
  𝑻𝑶𝑴𝑷4
  𝑻𝑶𝑼𝑹𝑳

        `, cmd: `${prefix}utilitiesmenu`
      },
      {
        title: "*🍁 IMAGE EDIT COMMANDS*",
        desc: `
  𝑩𝑳𝑼𝑹
  𝑪𝑰𝑹𝑪𝑳𝑬
  𝑱𝑨𝑰𝑳
  𝑹𝑬𝑴𝑶𝑽𝑬𝑩𝑮
  𝑻𝑹𝑰𝑮𝑮𝑬𝑹

        `, cmd: `${prefix}imagemanipulationmenu`
      },
      {
        title: "*🏮 AUDIO EDIT COMMANDS*",
        desc: `
  𝑩𝑨𝑺𝑺
  8D
  𝑩𝑳𝑶𝑾𝑵
  𝑫𝑬𝑬𝑷
  𝑭𝑨𝑻
  𝑭𝑨𝑺𝑻
  𝑻𝑬𝑴𝑷𝑶
  𝑵𝑰𝑮𝑯𝑻𝑪𝑶𝑹𝑬
  𝑹𝑬𝑽𝑬𝑹𝑺𝑬
  𝑹𝑶𝑩𝑶𝑻
  𝑺𝑳𝑶𝑾
  𝑺𝑴𝑶𝑶𝑻𝑯

        `, cmd: `${prefix}audioeditmenu`
      },
      {
        title: "*🏮 ESSENTIALS COMMANDS*",
        desc: `
  𝑬𝑳𝑬𝑴𝑬𝑵𝑻
  𝑰𝑮𝑼𝑺𝑬𝑹
  𝑺𝑪𝑹𝑬𝑬𝑵𝑺𝑯𝑶𝑻
  𝑺𝑨𝒀𝑬𝑵𝑮𝑳𝑰𝑺𝑯
  𝑺𝑨𝒀𝑱𝑨𝑷𝑨𝑵𝑬𝑺𝑬
  𝑸𝑼𝑬𝑺𝑻𝑰𝑶𝑵
  𝑼𝑫𝑰𝑪𝑻𝑰𝑶𝑵𝑨𝑹𝒀
  𝑻𝑹𝑰𝑽𝑰𝑨
  𝑽𝑰𝑬𝑾𝑶𝑵𝑪𝑬

        `, cmd: `${prefix}essenmenu`
      },
      {
        title: "*🎀 WEEB COMMANDS*",
        desc: `
  𝑨𝑵𝑰𝑴𝑬𝑸𝑼𝑶𝑻𝑬
  𝑪𝑶𝑺𝑷𝑳𝑨𝒀
  𝑪𝑶𝑺𝑷𝑳𝑨𝒀𝑽𝑰𝑫𝑬𝑶
  𝑭𝑶𝑿𝑮𝑰𝑹𝑳
  𝑴𝑨𝑰𝑫
  𝑶𝑷𝑷𝑨𝑰
  𝑾𝑨𝑳𝑳𝑷𝑨𝑷𝑬𝑹
 
        `, cmd: `${prefix}weebmenu`
      },
      {
        title: "*🫣 REACTIONS COMMANDS*",
        desc: `
  𝑩𝑬𝑯𝑨𝑷𝑷𝒀
  𝑩𝑰𝑻𝑬
  𝑩𝑶𝑵𝑲
  𝑩𝑼𝑳𝑳𝒀
  𝑪𝑹𝒀
  𝑫𝑨𝑵𝑪𝑬
  𝑯𝑨𝑵𝑫𝑯𝑶𝑵𝑫
  𝑯𝑨𝑷𝑷𝒀
  𝑯𝑰𝑮𝑯𝑭𝑰𝑽𝑬
  𝑯𝑼𝑮
  𝑲𝑰𝑪𝑲
  𝑲𝑰𝑳𝑳

        `, cmd: `${prefix}reactionsmenu`
      },
      {
        title: "*®️ LOGO COMMANDS*",
        desc: `
  𝟑𝐃𝐂𝐇𝐑𝐈𝐒𝐓𝐌𝐀𝐒
  𝟑𝐃𝐍𝐄𝐎𝐍
  𝟑𝐃𝐒𝐏𝐀𝐂𝐄
  𝟑𝐃𝐒𝐓𝐎𝐍𝐄
  𝐁𝐄𝐀𝐑
  𝐁𝐋𝐀𝐂𝐊𝐏𝐈𝐍𝐊
  𝐁𝐋𝐎𝐎𝐃
  𝐁𝐎𝐊𝐄𝐇
  𝐂𝐀𝐍𝐃𝐘
  𝐂𝐀𝐑𝐁𝐎𝐍
  𝐂𝐇𝐎𝐂𝐎𝐋𝐀𝐓𝐄
  𝐂𝐇𝐑𝐈𝐒𝐓𝐌𝐀𝐒

        `, cmd: `${prefix}logomakermenu`
      },
      {
        title: "*💫 FUN COMMANDS*",
        desc: `
  𝐀𝐖𝐄𝐒𝐎𝐌𝐄𝐂𝐇𝐄𝐂𝐊
  𝐂𝐇𝐀𝐑𝐀𝐂𝐓𝐄𝐑𝐂𝐇𝐄𝐂𝐊
  𝐂𝐔𝐓𝐄𝐂𝐇𝐄𝐂𝐊
  𝐂𝐎𝐈𝐍𝐅𝐋𝐈𝐏
  𝐃𝐀𝐑𝐄
  𝐒𝐓𝐀𝐋𝐊
  𝐃𝐈𝐂𝐄
  𝐅𝐀𝐂𝐓
  𝐆𝐀𝐘𝐂𝐇𝐄𝐂𝐊
  𝐆𝐑𝐄𝐀𝐓𝐂𝐇𝐄𝐂𝐊
  𝐇𝐀𝐍𝐃𝐒𝐎𝐌𝐄𝐂𝐇𝐄𝐂𝐊
  𝐇𝐎𝐑𝐍𝐘𝐂𝐇𝐄𝐂𝐊
  𝐋𝐄𝐒𝐁𝐈𝐀𝐍𝐂𝐇𝐄𝐂𝐊

        `, cmd: `${prefix}funmenu`
      },
      {
        title: "*💦 NSFW COMMANDS*",
        desc: `
  𝐀𝐍𝐔𝐒𝐕𝐈𝐄𝐖
  𝐀𝐒𝐒
  𝐀𝐍𝐈𝐌𝐀𝐋
  𝐀𝐍𝐈𝐌𝐀𝐋𝐄𝐀𝐑𝐒
  𝐁𝐀𝐑𝐄𝐅𝐎𝐎𝐓
  𝐁𝐄𝐃
  𝐁𝐄𝐋𝐋
  𝐁𝐈𝐊𝐈𝐍𝐈
  𝐁𝐋𝐎𝐍𝐃𝐄
  𝐁𝐎𝐍𝐃𝐀𝐆𝐄
  𝐁𝐑𝐀
  𝐁𝐑𝐄𝐀𝐒𝐓𝐇𝐎𝐋𝐃
        `, cmd: `${prefix}nsfwmenu`
      },
    ];

    const cards = [];

    for (const s of sections) {
      const media = await prepareWAMessageMedia(
        { image: { url: botImage6 } },
        { upload: Miku.waUploadToServer }
      );

      cards.push({
        body: proto.Message.InteractiveMessage.Body.fromObject({
          text: s.desc,
        }),
        footer: proto.Message.InteractiveMessage.Footer.fromObject({
          text: `Powered by ${botName}`,
        }),
        header: proto.Message.InteractiveMessage.Header.fromObject({
          title: s.title,
          hasMediaAttachment: true,
          imageMessage: media.imageMessage,
        }),
        nativeFlowMessage: proto.Message.InteractiveMessage.NativeFlowMessage.fromObject({
          buttons: [
            {
              name: "quick_reply",
              buttonParamsJson: JSON.stringify({
                display_text: "Open",
                id: s.cmd,
              }),
            },
          ],
        }),
      });
    }

    const msg = generateWAMessageFromContent(
      m.from,
      {
        viewOnceMessage: {
          message: {
            interactiveMessage: proto.Message.InteractiveMessage.fromObject({
              body: { text: welcomeText },
              carouselMessage: { cards },
            }),
          },
        },
      },
      {}
    );

    await Miku.relayMessage(m.from, msg.message, {
      messageId: msg.key.id,
    });
  },
};